[
 {
    "name": "UI/UX Design Contest",
    "image": "https://ibb.co.com/fGVrjCn5",
    "description": "Design a modern and user-friendly mobile app interface. This competition focuses on creating intuitive user experiences through thoughtful design decisions. Participants must design a complete mobile application interface that addresses a real-world problem, following Material Design or Apple Human Interface guidelines while maintaining originality. Emphasis should be placed on user flow, information architecture, visual hierarchy, and accessibility features. Designers must consider different user personas and create solutions that cater to diverse needs, including proper contrast ratios, readable typography, and intuitive navigation patterns that enhance user satisfaction and engagement.",
    "price": 400,
    "prizeMoney": 4000,
    "taskInstruction": "Design 5 mobile app screens using Figma.",
    "contestType": "Design",
    "deadline": "2025-12-23"
  },
  {
    "name": "React Coding Battle",
    "image": "https://ibb.co.com/mrDFqpgw",
    "description": "Test your React.js problem-solving skills in this intensive coding challenge. Participants will tackle complex React problems that test understanding of hooks, state management, component lifecycle, and performance optimization. The contest focuses on real-world scenarios including API integration, form handling, authentication flows, and responsive component design. Contestants must demonstrate proficiency in React best practices, clean code architecture, and efficient problem-solving techniques. Solutions will be evaluated based on correctness, code quality, performance optimization, and adherence to React conventions in building scalable applications.",
    "price": 600,
    "prizeMoney": 10000,
    "taskInstruction": "Solve 3 React-based coding problems.",
    "contestType": "Programming",
    "deadline": "2025-12-22"
  },
  {
    "name": "Logo Design Sprint",
    "image": "https://ibb.co.com/5XC4YsjQ",
    "description": "Create a unique logo for a startup brand in this fast-paced design challenge. Participants must design a versatile logo that works across various applications including digital platforms, print materials, and merchandise. The design should communicate the brand's identity clearly while being memorable and scalable. Designers must consider color psychology, typography, and symbolic representation to create a logo that resonates with the target audience. The final design should include variations for different backgrounds and sizes, demonstrating adaptability across multiple use cases and mediums.",
    "price": 300,
    "prizeMoney": 4000,
    "taskInstruction": "Submit a vector logo in SVG or AI format.",
    "contestType": "Design",
    "deadline": "2025-12-20"
  },
  {
    "name": "Python Algorithm Contest",
    "image": "https://ibb.co.com/67f1cdcr",
    "description": "Solve complex algorithmic problems using Python in this competitive programming challenge. Participants will tackle problems ranging from basic data structures to advanced algorithms involving dynamic programming, graph theory, and optimization techniques. The contest emphasizes clean, efficient code that solves problems optimally within given constraints. Contestants must demonstrate strong problem-solving skills, algorithmic thinking, and proficiency in Python's standard library. Solutions will be evaluated based on correctness, time complexity, space efficiency, and code readability in solving computational challenges.",
    "price": 700,
    "prizeMoney": 40000,
    "taskInstruction": "Solve 5 algorithm problems within the time limit.",
    "contestType": "Programming",
    "deadline": "2025-12-21"
  },
  {
    "name": "Content Writing Marathon",
    "image": "https://ibb.co.com/MkbXgWK0",
    "description": "Write high-quality blog articles on technology topics in this content creation challenge. Participants must produce engaging, well-researched articles that provide value to readers while maintaining originality and proper citation practices. The writing should demonstrate strong command of language, clear structure, and ability to explain complex technical concepts in accessible language. Articles must be optimized for both human readers and search engines, incorporating relevant keywords naturally. Writers should focus on creating compelling content with logical flow between sections.",
    "price": 600,
    "prizeMoney": 35000,
    "taskInstruction": "Write a 1200-word tech article (original content).",
    "contestType": "Writing",
    "deadline": "2025-12-19"
  },
  {
    "name": "Photography Competition",
    "image": "https://ibb.co.com/27Dy2Zqf",
    "description": "Showcase your best photography skills in this visual arts competition. Participants must submit high-quality photographs that demonstrate technical proficiency, artistic vision, and storytelling ability. The competition welcomes various photography genres including landscape, portrait, street, and abstract photography. Entries will be judged based on composition, lighting, technical execution, creativity, and emotional impact. Photographers should focus on capturing compelling moments, utilizing proper exposure techniques, and presenting their unique perspective through the lens.",
    "price": 400,
    "prizeMoney": 25000,
    "taskInstruction": "Submit 3 high-resolution photos.",
    "contestType": "Photography",
    "deadline": "2025-12-18"
  },
  {
    "name": "Machine Learning Mini Project",
    "image": "https://ibb.co.com/dJBjHjRV",
    "description": "Build a small ML model with real-world data in this data science challenge. Participants will work with provided datasets to create predictive models that solve practical problems. The competition emphasizes proper data preprocessing, feature engineering, model selection, and evaluation metrics. Contestants must document their entire process including exploratory data analysis, model development, and results interpretation. Submissions will be evaluated based on model accuracy, innovation in approach, code quality, and clarity of documentation explaining the methodology and findings.",
    "price": 1500,
    "prizeMoney": 80000,
    "taskInstruction": "Create a classification model and submit a GitHub repo.",
    "contestType": "Data Science",
    "deadline": "2025-12-28"
  },
  {
    "name": "Mobile App UI Contest",
    "image": "https://ibb.co.com/yn15VzhY",
    "description": "Design a clean and modern mobile app UI that prioritizes user experience and visual appeal. Participants must create interface designs that are not only aesthetically pleasing but also highly functional and intuitive. The designs should follow platform-specific guidelines while incorporating modern design trends and accessibility considerations. Emphasis should be placed on creating seamless user journeys, clear information hierarchy, and responsive layouts that adapt to different screen sizes. The competition rewards innovative solutions that balance creativity with practical usability.",
    "price": 900,
    "prizeMoney": 42000,
    "taskInstruction": "Design Android app UI screens in Figma.",
    "contestType": "Design",
    "deadline": "2025-12-24"
  },
  {
    "name": "Web Development Challenge",
    "image": "https://ibb.co.com/nWqCTCd",
    "description": "Build a responsive website using modern frontend tools. This contest challenges participants to create a fully functional, mobile-first website that demonstrates proficiency in HTML5, CSS3, and JavaScript frameworks. The website should implement responsive design principles and work seamlessly across all device sizes. Participants must incorporate interactive features, ensure cross-browser compatibility, and focus on clean code, performance optimization, and user experience. Submissions will be judged based on design aesthetics, functionality, code quality, and overall user engagement. The winning entry will showcase innovative solutions to common web development challenges while maintaining best practices in accessibility, SEO, and modern web standards.",
    "price": 10,
    "prizeMoney": 500,
    "taskInstruction": "Create a responsive website using React and Tailwind CSS.",
    "contestType": "Development",
    "deadline": "2025-12-25"
  },
  {
    "name": "Database Design Challenge",
    "image": "https://ibb.co.com/JWfbHPbF",
    "description": "Design an optimized relational database schema for a complex business scenario. Participants must create efficient database structures that ensure data integrity, performance, and scalability. The challenge involves designing proper normalization, establishing appropriate relationships, creating indexes, and writing optimized queries. Contestants must consider factors like data redundancy, query performance, backup strategies, and security considerations. The winning design will demonstrate a deep understanding of database principles while providing practical solutions to real-world data management challenges.",
    "price": 1000,
    "prizeMoney": 80000,
    "taskInstruction": "Create ER diagram and SQL schema.",
    "contestType": "Database",
    "deadline": "2025-12-26"
  }
]

